Repository: CJWorkbench/reshape
Catalog: locale/*/messages.po
Languages: el

# _spec.name
source: Reshape
el: Αναδιαμόρφωση

# _spec.description
source: Convert the table between wide and long formats.
el: Μετατροπή του πίνακα από μακρά σε πλατιά μορφή και αντίστροφα..

# _spec.parameters.direction.options.widetolong.label
source: Wide to long
el: Από πλατιά σε μακρά.

# _spec.parameters.direction.options.longtowide.label
source: Long to wide
el: Από μακρά σε πλατιά.

# _spec.parameters.direction.options.transpose.label
source: Transpose
el: Αντιμετάθεση

# _spec.parameters.colnames.name
source: Row variable
el: Μεταβλητή σειράς

# _spec.parameters.has_second_key.name
source: 2nd row variable
el: 2η μεταβλητή σειράς

# _spec.parameters.varcol.name
source: Column variable
el: Μεταβλητή στήλης

# wide_to_long.badColumns.mixedTypes.message
source: {n_columns, plural, other{# columns (see "{first_colname}") were} one {Column "{first_colname}" was}} auto-converted to Text because the value column cannot have multiple types.
el: Έγινε αυτόματη μετατροπή {n_columns, plural, other{# στηλών (δείτε "{first_colname}")} one {της στήλης "{first_colname}"}} σε κείμενο επειδή η στήλη τιμής δεν μπορεί να έχει διαφορετικούς τύπους.

# wide_to_long.badColumns.mixedTypes.quick_fix.text
source: Convert {n_columns, plural, one {# column} other {# columns}} to text
el: Μετατροπή {n_columns, plural, one {# στήλης} other {# στηλών}} σε κείμενο

# long_to_wide.badColumn.notText.message
source: Column "{column_name}" was auto-converted to Text because column names must be text.
el: Έγινε αυτόματη μετατροπή της στήλης "{column_name}" σε κείμενο επειδή τα ονόματα στηλών πρέπει να είναι κείμενο.

# long_to_wide.badColumn.notText.quick_fix.text
source: Convert "{column_name}" to text
el: Μετατροπή της στήλης "{column_name}" σε κείμενο

# long_to_wide.badRows.emptyColumnHeaders.warning
source: {n_rows, plural, one {# row with empty "{column_name}" was removed.} other {# rows with empty "{column_name}" were removed.}}
el: {n_rows, plural, one {# σειρά με κενή στήλη "{column_name}" αφαιρέθηκε.} other {# σειρές με κενή στήλη "{column_name}" αφαιρέθηκαν.}}

# long_to_wide.error.repeatedVariables
source: Cannot reshape: some variables are repeated
el: Δεν είναι δυνατή η αναδιαμόρφωση: μερικές μεταβλητές επαναλαμβάνονται

# long_to_wide.error.noValueColumn
source: There is no Value column. All but one table column must be a Row or Column variable.
el: Δεν υπάρχει στήλη τιμής. Όλες οι στήλες του πίνακα εκτός από μία πρέπει να είναι μεταβλητή σειράς ή στήλης.

# long_to_wide.error.tooManyValueColumns
source: There are too many Value columns. All but one table column must be a Row or Column variable. Please drop extra columns before reshaping.
el: Υπάρχουν πολλές στήλες τιμής. Όλες οι στήλες του πίνακα εκτός από μία πρέπει να είναι μεταβλητή σειράς ή στήλης. Αφαιρέστε τις επιπλέον στήλες πριν από την αναδιαμόρφωση.

# error.sameColumnAndRowVariables
source: Cannot reshape: column and row variables must be different
el: Δεν είναι δυνατή η αναδιαμόρφωση: οι μεταβλητές στηλών και σειρών πρέπει να είναι διαφορετικές

# transpose.warnings.tooManyRows
source: We truncated the input to {max_columns} rows so the transposed table would have a reasonable number of columns.
el: Περικόψαμε την είσοδο σε {max_columns} σειρές έτσι ώστε ο αντιμετατιθέμενος πίνακας να έχει λογικό αριθμό στηλών.

# transpose.warnings.headersConvertedToText.message
source: Headers in column "{column_name}" were auto-converted to text.
el: Έγινε αυτόματη μετατροπή των κεφαλίδων στη στήλη "{column_name}" σε κείμενο.

# transpose.warnings.headersConvertedToText.quickFix.text
source: Convert {column_name} to text
el: Μετατροπή της στήλης {column_name} σε κείμενο

# transpose.warnings.differentColumnTypes.message
source: {n_columns, plural, other {# columns (see "{first_colname}") were} one {Column "{first_colname}" was}} auto-converted to Text because all columns must have the same type.
el: Έγινε αυτόματη μετατροπή {n_columns, plural, other {# στηλών (δείτε "{first_colname}")} one {της στήλης "{first_colname}"}} σε κείμενο επειδή όλες οι στήλες πρέπει να ανήκουν στον ίδιο τύπο.

# transpose.warnings.differentColumnTypes.quickFix.text
source: Convert {n_columns, plural, other {# columns} one {# column}} to text
el: Μετατροπή {n_columns, plural, other {# στηλών} one {# στήλης}} σε κείμενο
